//
// K-13
// Бойко Катерина
//

#include <iostream>
#include <locale.h>

using namespace std;


/**
 * Функція для обчислення виразу 2/3+y/(x+2)
 *
 * @param x змінна для обчислення виразу, відмінна від -2
 * @param y змінна для обчислення виразу
 * @return double результат обчислень
 */
double f(double x, double y){
        return 2.0/3.0 + y/(x+2.0);
}

int main()
{
    setlocale(LC_ALL,"Ukrainian");

    cout << "Ця програма призначена для обчислення математичних виразів на основі введених користувачем значень змінних." << endl;
    cout << "Програму створила студентка групи К-13 Бойко Катерина."<< endl;

    cout << "Введіть, будь ласка значення змінних, дробову частину відділяючи крапкою."<< endl;
    double x, y;
    cout << "x (відмінне від -2): ";
    cin >> x;
    cout << "y: ";
    cin >> y;

    double result = f(x, y);
    cout << "Введені вами значення змінних:"<<endl<<"x = "<<x<<endl<<"y = "<<y<<endl;
    cout << "За таких даних, значення виразу 2/3 + y/(x+2) складає " << result << endl;

    return 0;
}
